app/controllers/fotos_controller.rb

  def index
    @fotos = Foto.all
---
SELECT "fotos".* FROM "fotos"

  def show
    @foto = Foto.find(params[:id])
---
SELECT "fotos".* FROM "fotos" WHERE "fotos"."id" = 1 LIMIT 1

  def create
    foto = Foto.new(params[:foto])
    flash[:info] = "Foto foi gravada com sucesso" if foto.save
---
INSERT INTO "fotos" ("name", "created_at", "updated_at", "imagem_file_name", "imagem_content_type", "imagem_file_size", "imagem_updated_at") VALUES ('rachad', '2011-02-16 19:51:17.490013', '2011-02-16 19:51:17.490013', 'carinhas contentes.jpg', 'image/jpeg', 53391, '2011-02-16 19:51:17.151803')